/* Blinking a LED
Συνδεσμολογία κυκλώματος:
PIN_0 => LED_Anode - LED_Cathode = > Αντίσταση 220Ω => Gnd
*/
//Η συνάρτηση setup() εμπεριέχει αρχικοποιήσεις
//Εκτελείται μόνο μία φορά κατά την τροφοδοσία του Arduino Uno
void setup()
{
  //Ρυθμίζεται το pin 0 ως output (έξοδος)
  pinMode(0, OUTPUT);
}
//Αυτή η συνάρτηση εκτελείται διαρκώς
void loop()
{
  digitalWrite(0, HIGH); // Γράφει HIGH (5V) στο pin 0 – LED ON
  delay(1000); // Σταματάει το πρόγραμμα για 1000 χιλιοστά του δευτερολέπτου
  digitalWrite(0, LOW); // Γράφει LOW (0V) στο pin 0 – LED OFF
  delay(1000); // Σταματάει το πρόγραμμα για 1000 χιλιοστά του δευτερολέπτου
}
