/* RGB LED

Συνδεσμολογία κυκλώματος:
PIN_9   => Αντίσταση 220Ω =>  Κόκκινο pin από το RGB LED
PIN_11 => Αντίσταση 220Ω =>  Μπλε pin από το RGB LED
PIN_10 => Αντίσταση 220Ω =>  Πράσινο pin από το RGB LED
*/

#define R_pin 9            //ονομάζουμε “R_pin” το PIN_9
#define G_pin 11          //ονομάζουμε “G_pin” το PIN_11
#define B_pin 10          //ονομάζουμε “B_pin” το PIN_10

//Η συνάρτηση setup() εμπεριέχει αρχικοποιήσεις
//Εκτελείται μόνο μία φορά κατά την τροφοδοσία του Arduino Uno
void setup()
{
  //Ρυθμίζεται το pin 9, pin 10, pin 11 ως output (έξοδος)
  pinMode(R_pin, OUTPUT);
  
  pinMode(B_pin, OUTPUT);
}

//Αυτή η συνάρτηση εκτελείται διαρκώς
void loop() 
{
  set_RGB(255, 0, 0);  // κλήση συνάρτησης για κόκκινο χρώμα
  delay(1000);       // Αναμονή για 1 δευτερόλεπτο
  
  set_RGB(0, 255, 0);   // κλήση συνάρτησης για πράσινο χρώμα
  delay(1000);        // Αναμονή για 1 δευτερόλεπτο
  
  set_RGB(0, 0, 255);   // κλήση συνάρτησης για μπλε χρώμα
  delay(1000);        // Αναμονή για 1 δευτερόλεπτο
  
  set_RGB(255, 0, 255);   // κλήση συνάρτησης για το magenta
  delay(1000);            // Αναμονή για 1 δευτερόλεπτο
  
  set_RGB(255, 255, 0);   // κλήση συνάρτησης για το κίτρινο χρώμα
  delay(1000);            // Αναμονή για 1 δευτερόλεπτο
  
  set_RGB(255, 255, 255); // κλήση συνάρτησης για το λευκό χρώμα
  delay(1000);    // Αναμονή για 1 δευτερόλεπτο
  
  set_RGB(192, 192, 192); // κλήση συνάρτησης για το ασημί χρώμα
  delay(1000);    // Αναμονή για 1 δευτερόλεπτο
  
  set_RGB(128, 0, 128); // κλήση συνάρτησης για το μωβ χρώμα
  delay(1000);    // Αναμονή για 1 δευτερόλεπτο
}

//Αυτή η συνάρτηση ορίζει τιμές στο RGB LED
void set_RGB(int R_value, int G_value, int B_value)
 {
  analogWrite(R_pin, R_value);  //ορισμός τιμής (από 0 έως 255) στο PIN 9
  analogWrite(G_pin, G_value);  //ορισμός τιμής (από 0 έως 255) στο PIN 11
                                                        //ορισμός τιμής (από 0 έως 255) στο PIN 10
}
